app/controllers/records_controller.rb

  def index
    @records = current_user.records.all
---
SELECT "records".* FROM "records" WHERE "records"."user_id" = $1  [["user_id", 1]]

  def show
    render json: Record.find(params[:id])
---
SELECT  "records".* FROM "records" WHERE "records"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @record = Record.new(record_params)
    @record.user_id = current_user.id
    # @record = Record.new(record_params)

    if @record.save
---
INSERT INTO "records" ("symptom", "date", "details", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["symptom", "hand is numb"], ["date", "2016-01-02"], ["details", "my hand went numb and it hurts"], ["created_at", "2016-06-05 18:04:07.442015"], ["updated_at", "2016-06-05 18:04:07.442015"]]

  def update
    @record = Record.find(params[:id])

    if @record.update(record_params)
---
SELECT  "records".* FROM "records" WHERE "records"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "records" SET "details" = $1, "updated_at" = $2 WHERE "records"."id" = $3  [["details", "My updated details"], ["updated_at", "2016-06-05 19:27:24.435410"], ["id", 2]]

  def destroy
    @record.destroy
---
DELETE FROM "records" WHERE "records"."id" = $1  [["id", 2]]